In [3]:
import pandas as pd

In [4]:
filepath="DataFiles/car_sales.csv.csv"
df=pd.read_csv(filepath)

In [4]:
df.tail()

   Manufacturer    Model  Year  Sales  Revenue
15         Ford   Escape  2023   2100    75000
16    Chevrolet  Equinox  2021   1700    60000
17    Chevrolet    Tahoe  2022   2200    80000
18       Nissan    Rogue  2023   2300    85000
19       Nissan   Murano  2021   1800    65000

In [5]:
df.head()

  Manufacturer    Model  Year   Sales  Revenue
0       Toyota  Corolla  2021  1500.0  50000.0
1       Toyota    Camry  2022  2000.0  70000.0
2        Honda    Civic  2022  1800.0  60000.0
3        Honda   Accord  2021  1700.0      NaN
4         Ford  Mustang  2023  2200.0  80000.0

In [6]:
df.isnull().sum()

Manufacturer    1
Model           0
Year            0
Sales           1
Revenue         1
dtype: int64

In [7]:
df[df.isnull().any(axis=1)]

  Manufacturer   Model  Year   Sales  Revenue
3        Honda  Accord  2021  1700.0      NaN
7          NaN  Malibu  2021  1400.0  50000.0
8       Nissan  Altima  2022     NaN  70000.0

In [9]:
df.fillna(value={'Manufacturer': 'unknown'},inplace=True)

In [10]:
df[df.isnull().any(axis=1)]

  Manufacturer   Model  Year   Sales  Revenue
3        Honda  Accord  2021  1700.0      NaN
8       Nissan  Altima  2022     NaN  70000.0

In [13]:
df.head(10)

  Manufacturer      Model  Year  Sales  Revenue
0       Toyota    Corolla  2021   1500    50000
1       Toyota      Camry  2022   2000    70000
2        Honda      Civic  2022   1800    60000
3        Honda     Accord  2021   1700    65000
4         Ford    Mustang  2023   2200    80000
5         Ford     Fusion  2021   1600    55000
6    Chevrolet  Silverado  2022   1900    75000
7    Chevrolet     Malibu  2021   1400    50000
8       Nissan     Altima  2022   2100    70000
9       Nissan     Sentra  2023   2300    85000

In [11]:
average=df['Sales'].mean()
df.fillna(value={'Sales':average},inplace=True)

In [18]:
df.head(10)

  Manufacturer      Model  Year  Sales  Revenue
0       Toyota    Corolla  2021   1500    50000
1       Toyota      Camry  2022   2000    70000
2        Honda      Civic  2022   1800    60000
3        Honda     Accord  2021   1700    65000
4         Ford    Mustang  2023   2200    80000
5         Ford     Fusion  2021   1600    55000
6    Chevrolet  Silverado  2022   1900    75000
7    Chevrolet     Malibu  2021   1400    50000
8       Nissan     Altima  2022   2100    70000
9       Nissan     Sentra  2023   2300    85000

In [12]:
df.dropna(inplace=True)

In [20]:
df.head(10)

  Manufacturer      Model  Year  Sales  Revenue
0       Toyota    Corolla  2021   1500    50000
1       Toyota      Camry  2022   2000    70000
2        Honda      Civic  2022   1800    60000
3        Honda     Accord  2021   1700    65000
4         Ford    Mustang  2023   2200    80000
5         Ford     Fusion  2021   1600    55000
6    Chevrolet  Silverado  2022   1900    75000
7    Chevrolet     Malibu  2021   1400    50000
8       Nissan     Altima  2022   2100    70000
9       Nissan     Sentra  2023   2300    85000

In [21]:
df[df.duplicated()]

Empty DataFrame
Columns: [Manufacturer, Model, Year, Sales, Revenue]
Index: []

In [22]:
df.drop_duplicates(inplace=True)

In [23]:
df.tail()

   Manufacturer    Model  Year  Sales  Revenue
15         Ford   Escape  2023   2100    75000
16    Chevrolet  Equinox  2021   1700    60000
17    Chevrolet    Tahoe  2022   2200    80000
18       Nissan    Rogue  2023   2300    85000
19       Nissan   Murano  2021   1800    65000

In [13]:
df.duplicated().sum()

0

In [26]:
df.dtypes

Manufacturer    object
Model           object
Year             int64
Sales            int64
Revenue          int64
dtype: object

In [29]:
new_df=pd.DataFrame({"name":["Alice","Bob","Alice"],"age":[25,30,25]})

In [30]:
new_df

    name  age
0  Alice   25
1    Bob   30
2  Alice   25

In [32]:
new_df['age']=new_df['age'].astype (float)
new_df

    name   age
0  Alice  25.0
1    Bob  30.0
2  Alice  25.0

In [33]:
df.head()

  Manufacturer    Model  Year  Sales  Revenue
0       Toyota  Corolla  2021   1500    50000
1       Toyota    Camry  2022   2000    70000
2        Honda    Civic  2022   1800    60000
3        Honda   Accord  2021   1700    65000
4         Ford  Mustang  2023   2200    80000

In [15]:
q1=df["Sales"].quantile(0.25)
q3=df["Sales"].quantile(0.75)
iqr=q3-q1
print(q1,q3,iqr)

1650.0 2150.0 500.0

In [16]:
lower_bond=q1-1.5*iqr

In [19]:
lower_bond

900.0

In [20]:
# Above Q3+1.5*IQR
upper_bond=q3+1.5*iqr

In [21]:
upper_bond

2900.0

In [22]:
required = df[(df["Sales"]>=lower_bond) & (df["Sales"]<=upper_bond)]
print("All Sales\n",df["Sales"].values)
print("Sales after removing outliers\n",required["Sales"].values)

All Sales
 [1500.         2000.         1800.         2200.         1600.
 1900.         1400.         1878.94736842 2300.         1600.
 1900.         2200.         1500.         2000.         2100.
 1700.         2200.         2300.         1800.        ]
Sales after removing outliers
 [1500.         2000.         1800.         2200.         1600.
 1900.         1400.         1878.94736842 2300.         1600.
 1900.         2200.         1500.         2000.         2100.
 1700.         2200.         2300.         1800.        ]

In [23]:
df.to_csv('DataFiles/Cleaned_Data.csv',index=False)